Revit 2027 API
BuiltInFailures.RegenFailures.CircularDependencyUncutError Property
 There is a circular chain of references among the highlighted elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CircularDependencyUncutError { get; }
Public Shared ReadOnly Property CircularDependencyUncutError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CircularDependencyUncutError {
	FailureDefinitionId^ get ();
}
static member CircularDependencyUncutError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RegenFailures Class
Autodesk.Revit.DB Namespace